src/InformationRegisters/СостояниеВидовЯчеек/СостояниеВидовЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеВидовЯчеек</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВидЯчейки</name>
    <type>
      <types>EnumRef.ВидыСкладскихЯчеек</types>
    </type>
  </resources>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/РазмещениеТоваровНаСкладах/РазмещениеТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеТоваровНаСкладах</name>
  <resources>
    <name>КоличествоЕХО</name>
    <comment>(в единицах хранения остатков)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Удалить2НомерПаллета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УдалитьНомерПаллета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРазмещенийВЯчейках</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаллета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьЕдиница</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СостояниеБлокировокЯчеек/СостояниеБлокировокЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеБлокировокЯчеек</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Заблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеРезервовЯчеек/СостояниеРезервовЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРезервовЯчеек</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Заблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеВидовЯчеек/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.Количество() > 1 Тогда
		Отказ = Истина;
		Сообщить("Запрещено сохранять более одной записи одновременно", СтатусСообщения.Важное);
	ИначеЕсли ЭтотОбъект.Количество() > 0 Тогда
		ТекЗапись = ЭтотОбъект[0];
		
		//ОтборЗаписей = Новый Структура("Склад, Номенклатура", ТекЗапись.Склад, ТекЗапись.Номенклатура);
		//тзПредЗапись = РегистрыСведений.АдресаХраненияНоменклатурыНаСкладах.СрезПоследних(ТекЗапись.Период, ОтборЗаписей);
		//Если тзПредЗапись.Количество() > 0 Тогда
		//	ПредЗапись = тзПредЗапись[0];
		//Иначе
		//	Возврат;
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РазмещениеТоваровНаСкладахОстатки.КоличествоЕХООстаток) КАК КоличествоЕХООстаток
		|ИЗ
		|	РегистрНакопления.РазмещениеТоваровНаСкладах.Остатки(&НаДату, Ячейка = &Ячейка) КАК РазмещениеТоваровНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("НаДату", КонецДня(ТекЗапись.Период));
		Запрос.УстановитьПараметр("Ячейка", ТекЗапись.Ячейка);
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].КоличествоЕХООстаток <> 0 Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как в ней содержится товар", СтатусСообщения.Важное);
		КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеБлокировокЯчеекСрезПоследних.Заблокирована
		|ИЗ
		|	РегистрСведений.СостояниеБлокировокЯчеек.СрезПоследних(, Ячейка = &Ячейка) КАК СостояниеБлокировокЯчеекСрезПоследних";
		
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].Заблокирована Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как она заблокирована", СтатусСообщения.Важное);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеРезервовЯчеекСрезПоследних.Заблокирована
		|ИЗ
		|	РегистрСведений.СостояниеРезервовЯчеек.СрезПоследних(, Ячейка = &Ячейка) КАК СостояниеРезервовЯчеекСрезПоследних";
		
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].Заблокирована Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как эта ячейка зарезервирована", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
